import * as Dialog from "@radix-ui/react-dialog";

export default function Welcome() {
  return (
    <>
      <div
        className="flex flex-col items-center justify-center py-10 sm:px-32 sm:py-20 px-5"
        id="welcome"
      >
        <span className="text-2xl sm:text-3xl py-5">
          Welcome to <span className="font-bold">Our Church</span>
        </span>
        <p className="text-center sm:text-xl">
          இவ்வாலயம் அமைந்துள்ள இடமானது 1988-ஆம் ஆண்டு அருட்பணி எஸ். பீட்டர்
          குழந்தை அவர்கள் பங்குத்தந்தையாக இருந்த போது வாங்கப்பட்டது. 1998-ஆம்
          ஆண்டு அப்போதைய பங்குத்தந்தை அருட்தந்தை அ. அந்தோணி பாக்கியம் அவர்களின்
          முயற்சியாலும், இப்பகுதி மக்களின் ஒத்துழைப்போடும், மதுரை உயர் மறை
          மாவட்ட பேராயர் மேதகு மரியானுஸ் ஆரோக்கியசாமி ஆண்டகை அவர்களின் நிதி
          உதவியுடன் ஒரு சிற்றாலயம் கீற்றுக் கொட்டகையுடன் கட்டப்பட்டு, 1999-ஆம்
          ஆண்டு அன்னையின் பிறப்பு விழாவாகிய செப்டம்பர் மாதம் 08-ஆம் தேதி
          அர்ச்சிக்கப்பட்டது.
        </p>
        <Dialog.Dialog>
          <Dialog.Trigger className="btn px-5 py-3 bg-orange-800 my-6 text-white hover:bg-orange-950 rounded-md transition duration-300">
            Know More
          </Dialog.Trigger>
          <Dialog.Overlay className="fixed flex justify-center items-center inset-0 bg-black bg-opacity-50" />
          <Dialog.Content className="fixed z-50 inset-0 flex justify-center items-center">
            <div className="sm:w-6/12 w-11/12 bg-white py-10 px-10 rounded-md">
              <span className=" w-full flex justify-between items-center text-gray-800 mb-5">
                <span className="font-bold uppercase text-xl">Our Church</span>
                <Dialog.Close>
                  <i className="fa-solid fa-xmark"></i>
                </Dialog.Close>
              </span>
              <p className="text-justify h-96 overflow-y-scroll pr-3 text-sm">
                மரியானூஸ் நகர் தூய ஆரோக்கிய அன்னை ஆலயத் திருவிழா 28.09.2021 ஆகிய
                இன்று கொடியேற்றத்துடன் ஆரம்பமாகிறது.. ஆகவே ஏற்கனவே பதிவு
                செய்யப்பட்ட இவ்வாலயத்தை மீண்டும் ஒருமுறை பதிவு செய்கின்றோம்...
                <br /> <br /> ⛪ஆலயம் அறிவோம் வரிசையில் 285 -வதாக இன்று "தூய
                ஆரோக்கிய அன்னை ஆலயம், மரியானுஸ்நகர், சிவகாசி" குறித்த தகவல்களை
                பதிவு செய்கின்றோம். <br /> <br />
                🍅பெயர் : தூய ஆரோக்கிய அன்னை ஆலயம் <br /> <br /> 🍅இடம் :
                மரியானுஸ் நகர், சிவகாசி மேற்கு அஞ்சல் <br /> <br /> 🍊நிலை :
                பங்குதளம் <br /> <br /> 🍊கிளைகள் : இல்லை 🍋மாவட்டம் :
                விருதுநகர் <br /> <br /> 🍋மறைமாவட்டம் : மதுரை உயர் மறை மாவட்டம்{" "}
                <br /> <br />
                🌹மறைவட்டம்: விருதுநகர் <br /> <br /> ♥️பங்குத்தந்தை : அருட்பணி.
                செபாஸ்டின் ஜெறோம்
                <br /> <br />
                🌹குடும்பங்கள் : 250 <br /> <br /> 🌹அன்பியங்கள் : 8 <br />{" "}
                <br />
                🌺ஞாயிறு திருப்பலி : காலை 08.00 மணிக்கு <br /> <br />{" "}
                🌷நாள்தோறும் திருப்பலி மாலை 07.00 மணி <br /> <br />
                🌷இரண்டாவது சனி காலை 10:00 மணிக்கு குணமளிக்கும் வழிபாடு,
                நற்கருணை ஆசீர், திருப்பலி, தொடர்ந்து மதிய உணவு <br /> <br />{" "}
                🌺திருவிழா : ஆகஸ்ட் மாதம் 30-ஆம் தேதி ஆரம்பித்து செப்டம்பர்
                மாதம் 09-ஆம் தேதி நிறைவடைகின்ற வகையில் 11 நாட்கள். <br /> <br />{" "}
                <hr /> <br />
                ஆலய வரலாறு: <br />
                ***************** <br /> <br /> 🌳சிவகாசி, ரிசர்வ்லைன்
                திருவில்லிபுத்தூர் - விருதுநகர் புறவழிச்சாலையில், எஸ். என் புரம்
                செல்லும் சாலையில் மனதிற்கு அமைதியும், நாடி வரும் மக்களுக்கு நல்ல
                ஆரோக்கியத்தையும், கேட்கும் வரங்களை பெற்றுத்தரும் வகையில்
                அமைந்துள்ளது தூய ஆரோக்கிய அன்னை ஆலயம். <br /> 🌸சிவகாசி பங்கின்
                ஒரு பகுதியாக, இப்பகுதி இருந்தது. <br /> 🌸இவ்வாலயம் அமைந்துள்ள
                இடமானது 1988-ஆம் ஆண்டு அருட்பணி எஸ். பீட்டர் குழந்தை அவர்கள்
                பங்குத்தந்தையாக இருந்த போது வாங்கப்பட்டது. <br /> 🌸1998-ஆம்
                ஆண்டு அப்போதைய பங்குத்தந்தை அருட்தந்தை அ. அந்தோணி பாக்கியம்
                அவர்களின் முயற்சியாலும், இப்பகுதி மக்களின் ஒத்துழைப்போடும்,
                மதுரை உயர் மறை மாவட்ட பேராயர் மேதகு மரியானுஸ் ஆரோக்கியசாமி
                ஆண்டகை அவர்களின் நிதி உதவியுடன் ஒரு சிற்றாலயம் கீற்றுக்
                கொட்டகையுடன் கட்டப்பட்டு, 1999-ஆம் ஆண்டு அன்னையின் பிறப்பு
                விழாவாகிய செப்டம்பர் மாதம் 08-ஆம் தேதி அர்ச்சிக்கப்பட்டது.{" "}
                <br /> 🍀மேதகு பேராயர் மரியானுஸ் ஆரோக்கியசாமி அவர்கள் வழங்கிய
                நிதியுதவியைக் கொண்டு இவ்வாலயம் உருவாக்கப்பட்டதால், அன்னாரின்
                பெயரைத் தாங்கியதாக இப்பகுதி 'மரியானுஸ் நகர்' என்று பெயர்
                பெற்றது. <br /> 🍀மேலும் தற்போது காணப்படும் ஆலயம் எழுப்ப
                2002-ஆம் ஆண்டு அப்போதைய பங்குத்தந்தை அருட்தந்தை. அந்தோணி
                பாக்கியம் அவர்களின் உதவியுடன், மதுரை உயர் மறை மாவட்ட துணை ஆயர்
                மேதகு அந்தோணி பாப்புசாமி அவர்களால் அடிக்கல் நாட்டப்பட்டது.{" "}
                <br /> 🍀அருட்பணி. பெனடிக்ட் அம்புரோஸ் அவர்கள் பங்குத்தந்தையாக
                இருந்த போது இவ்வாலயம் கட்டி முடிக்கப்பட்டு, 2005-ஆம் ஆண்டு
                பேராயர் மேதகு பீட்டர் பெர்னாண்டோ அவர்களால் அர்ச்சிக்கப்பட்டது.
                அதன் பின்னர் அருட்தந்தை டேவிட் தர்மராஜ் அவர்களின் பணிக்காலத்தில்
                2015 -ஆம் ஆண்டு இவ்வாலயத்தில் மாதா கெபியும், ஆரோக்கிய அன்னையின்
                குருசடியும் கட்டப்பட்டது.
                <br />
                🌳பசுமையான மரங்கள் நிறைந்த அமைதியான இயற்கையான சூழலில் இவ்வாலயம்
                அமைந்துள்ளது தனிச்சிறப்பு. தூய ஆரோக்கிய அன்னை சாதி மத பேதமின்றி
                அனைத்து மக்களுக்கும் அருள் வளங்களை வழங்கி பாதுகாத்து வருவதால்,
                பல்வேறு பகுதிகளில் இருந்தும் மக்கள் அதிகமாக வந்து தங்கள்
                வேண்டுதல்களை அன்னையிடம் எடுத்துக் கூறி, அவர் வழியாக இறைவனின்
                ஆசீர்வாதங்களை பெற்றுச் செல்கின்றனர். <br /> 🍎அன்னையின் வழியாக
                பல புதுமைகள் நாள்தோறும் நடந்து வருவதால் இவ்வாலயம் நாடி வரும்
                மக்களின் எண்ணிக்கை அதிகரித்து கொண்டே சென்றதால், இத்திருத்தலத்தை
                தனிப்பங்காக அமைத்தால் சிறப்பாக இருக்கும் என்று இப்பகுதி மக்கள்
                மிகுந்த ஆர்வத்துடன் நெடிய கனவுடன் இருந்தனர். <br />
                🌷இக்கனவு நிறைவேறும் வகையில் 13-07-2018 அன்று சிவகாசி
                பங்கிலிருந்து பிரிக்கப்பட்டு மதுரை பேராயர் மேதகு அந்தோணி
                பாப்புசாமி ஆண்டகை அவர்களால் ஆடம்பர கூட்டுத்திருப்பலி
                நிறைவேற்றப்பட்டு தனிப்பங்காக உயர்த்தப்பட்டது. <br />
                🍓பங்கின் முதல் பங்குத்தந்தையாக அருட்பணி. செபாஸ்டின் ஜெறோம்
                அவர்கள் நியமிக்கப்பட்டார். முதல் பங்குத்தந்தையின் முயற்சியால்
                பல்வேறு வளர்ச்சிப் பணிகள் மேற்கொள்ளப்பட்டு, குறிப்பாக தற்போது
                பங்குத்தந்தையின் முயற்சியால் சுகாதார வளாகம், புதிய ஜெனரேட்டர்
                அறை, புதிய கொடிமரம் ஆகியவை அமைக்கப்பட்டு, 28.09.2021 அன்று
                பேராயர் அந்தோணி பாப்புசாமி அவர்களால் அர்ச்சிக்கப் படுகிறது.{" "}
                <br />
                💐ஆலயம் அறிவோம் பதிவாளர் மின்னஞ்சல் : joseeye1@gmail.com
                இயேசுவுக்கே புகழ்..! இயேசுவுக்கே நன்றி..! மரியே வாழ்க..! <br />
                <br />
                <div className="text-center">💐🙏💐</div>
              </p>
            </div>
          </Dialog.Content>
        </Dialog.Dialog>
      </div>
    </>
  );
}
